/* ---------------------------------------------------------
কিভাবে লুপের চালিয়ে ১ - ৬ পর্যন্ত শো করাবে (Incremental)?
----------------------------------------------------------- */

for(let i = 1; i <= 6; i++){
    console.log(i);
}

/* ---------------------------------------------------------
কিভাবে লুপের ১-৬ যোগফল বের করবে Incremental ভাবে ?
----------------------------------------------------------- */

let sum = 0;    // যোগের ক্ষেত্রে ডিফল্ট মান শূন্য
for (let i = 1; i <= 6; i++){
    sum = sum + i;
}
console.log("Total adition is", sum, "(Incremental way - 1, 2, 3, 4, 5, 6)");


/* ---------------------------------------------------------
কিভাবে লুপের চালিয়ে ১ - ৬ পর্যন্ত শো করাবে (Decremental)?
----------------------------------------------------------- */

for (let i = 6; i >= 1; i--){
    console.log(i);
}


/* ---------------------------------------------------------
কিভাবে লুপের ১-৬ যোগফল বের করবে Decremental ভাবে ?
----------------------------------------------------------- */

let sum1 = 0;
for ( let i = 6; i >= 1; i--){
    sum1 = sum1 + i;
}
console.log(sum1);



/* ---------------------------------------------------------
Function দিয়ে কিভাবে লুপের ১-৬ যোগফল বের করবে Decremental ভাবে ?
----------------------------------------------------------- */

function sum(i){
    if (i == 1){
    return 1;
}
    return i + sum (i - 1);
}
console.log(sum(6));